---
kind: method
id: M:Autodesk.Revit.Creation.Application.NewCategorySet
source: html/43cc0dab-85d2-5e24-d6a7-2cccb6f39ad0.htm
---
# Autodesk.Revit.Creation.Application.NewCategorySet Method

Creates a new instance of a set specifically for holding category objects.

## Syntax (C#)
```csharp
public CategorySet NewCategorySet()
```

## Returns
A new instance of a Category Set.

## Remarks
This type of set is used during the creation of instance and type bindings.